# PyCity Schools Analysis

In [165]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load 
school_data_to_load ="../Pandas-Homework-4/PyCitySchools/Resources/schools_complete.csv"
student_data_to_load ="../Pandas-Homework-4/PyCitySchools/Resources/students_complete.csv"

#C:\Bootcamp\Homework\Homework 4\Pandas-Homework-4\PyCitySchools\Resources

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [166]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [167]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

## creating a list of 1 term - the number of scools

In [168]:
schools_count_row = school_data.shape[0]  # gives number of row count
schools_count_col = school_data.shape[1]  # gives number of col count

total_schools = [schools_count_row]
total_schools

[15]

In [169]:
students_count_row = student_data.shape[0]  # gives number of row count
students_count_col = student_data.shape[1]  # gives number of col count

total_students = [students_count_row]
total_students

[39170]

In [170]:
total_budget = [school_data["budget"].sum()]
total_budget

[24649428]

In [171]:
average_math_score = [student_data["math_score"].mean()]
average_math_score

[78.98537145774827]

In [172]:
passing_math = student_data.loc[student_data["math_score"] >= 70]
num_passing_math = [passing_math.shape[0]]
num_passing_math

[29370]

In [173]:
math_pass_percent = [num_passing_math[0] / total_students[0]]
math_pass_percent

[0.749808526933878]

In [174]:
average_reading_score = [student_data["reading_score"].mean()]
average_reading_score

[81.87784018381414]

In [175]:
passing_reading = student_data.loc[student_data["reading_score"] >= 70]
num_passing_reading = [passing_reading.shape[0]]
num_passing_reading

[33610]

In [176]:
reading_pass_percent = [num_passing_reading[0] / total_students[0]]
reading_pass_percent

[0.8580546336482001]

In [177]:
overall_passing_rate = [(average_math_score[0] + average_reading_score[0]) / 2]
overall_passing_rate

[80.43160582078121]

In [178]:
district_summary_df = pd.DataFrame({
    "Total Schools": total_schools,
    "Total Students": total_students,
    "Total Budget": total_budget,
    "Average Math Score": average_math_score,
    "Average Reading Score": average_reading_score,
    "% Passing Math": math_pass_percent,
    "% Passing Reading": reading_pass_percent,
    "% Overall Passing Rate": overall_passing_rate
})
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,0.749809,0.858055,80.431606

In [74]:
data_by_school = school_data_df.groupby(["school_name"])
school_sum_data = data_by_school.sum

In [77]:
school_sum_data["budget"].sum()

82932329558